{"id": "preamble", "text": "Whereas sovereignty over the entire Universe belongs to Almighty Allah alone, and the authority to be exercised by the people of Pakistan within the limits prescribed by Him is a sacred trust; and it is the will of the people of Pakistan to establish an order..."}

{"id": "article_1", "text": "Pakistan shall be a Federal Republic to be known as the Islamic Republic of Pakistan, hereinafter referred to as Pakistan."}

{"id": "article_2", "text": "Islam shall be the State religion of Pakistan."}

{"id": "article_2A", "text": "The principles and provisions set out in the Objectives Resolution are hereby made substantive part of the Constitution and shall have effect accordingly."}

{"id": "article_3", "text": "The State shall ensure the elimination of all forms of exploitation and the gradual fulfillment of the fundamental principle, from each according to his ability to each according to his work."}

{"id": "article_4", "text": "To enjoy the protection of law and to be treated in accordance with law is the inalienable right of every citizen."}

{"id": "article_5", "text": "Loyalty to the State is the basic duty of every citizen. Obedience to the Constitution and law is the inviolable obligation of every citizen."}

{"id": "article_6", "text": "Any person who abrogates or attempts to abrogate the Constitution by unconstitutional means shall be guilty of high treason."}

{"id": "article_7", "text": "In this Part, 'The State' means the Federal Government, Parliament, a Provincial Government, a Provincial Assembly, and such local or other authorities in Pakistan."}

{"id": "article_8", "text": "Any law, or any custom or usage having the force of law, in so far as it is inconsistent with the rights conferred by this Chapter, shall, to the extent of such inconsistency, be void."}

{"id": "article_9", "text": "No person shall be deprived of life or liberty save in accordance with law."}

{"id": "article_10", "text": "No person who is arrested shall be detained in custody without being informed of the grounds for such arrest."}

{"id": "article_10A", "text": "For the determination of his civil rights and obligations or in any criminal charge a person shall be entitled to a fair trial and due process."}

{"id": "article_11", "text": "Slavery is non-existent and forbidden and no law shall permit or facilitate its introduction into Pakistan in any form."}

{"id": "article_12", "text": "No law shall authorize the punishment of a person for an act or omission that was not punishable by law at the time it was committed."}

{"id": "article_13", "text": "No person shall be prosecuted or punished for the same offence more than once, or be compelled to be a witness against himself."}

{"id": "article_14", "text": "The dignity of man and, subject to law, the privacy of home, shall be inviolable."}

{"id": "article_15", "text": "Every citizen shall have the right to remain in, and, subject to any reasonable restriction imposed by law in the public interest, enter and move freely throughout Pakistan and to reside and settle in any part thereof."}

{"id": "article_16", "text": "Every citizen shall have the right to assemble peacefully and without arms, subject to any reasonable restrictions imposed by law in the interest of public order."}

{"id": "article_17", "text": "Every citizen shall have the right to form associations or unions, subject to any reasonable restrictions imposed by law in the interest of sovereignty or integrity of Pakistan."}

{"id": "article_18", "text": "Every citizen shall have the right to enter upon any lawful profession or occupation, and to conduct any lawful trade or business."}

{"id": "article_19", "text": "Every citizen shall have the right to freedom of speech and expression, and there shall be freedom of the press, subject to any reasonable restrictions imposed by law in the interest of the glory of Islam, national security, or public order."}

{"id": "article_19A", "text": "Every citizen shall have the right to access to information in all matters of public importance."}

{"id": "article_20", "text": "Subject to law, public order and morality, every citizen shall have the right to profess, practice and propagate his religion."}

{"id": "article_21", "text": "No person shall be required to pay any special tax for the promotion or maintenance of any religion other than his own."}

{"id": "article_22", "text": "No person attending any educational institution shall be required to receive religious instruction, or take part in any religious ceremony, or attend religious worship if such instruction, ceremony or worship relates to a religion other than his own."}

{"id": "article_23", "text": "Every citizen shall have the right to acquire, hold and dispose of property in any part of Pakistan, subject to the Constitution and any reasonable restrictions imposed by law in the public interest."}

{"id": "article_24", "text": "No person shall be compulsorily deprived of his property save in accordance with law."}

{"id": "article_25", "text": "All citizens are equal before law and are entitled to equal protection of law."}

{"id": "article_25A", "text": "The State shall provide free and compulsory education to all children of the age of five to sixteen years in such manner as may be determined by law."}

{"id": "article_26", "text": "No citizen otherwise qualified for admission in any educational institution shall be denied admission on the ground only of race, religion, caste or place of birth."}

{"id": "article_27", "text": "No citizen otherwise qualified for appointment in the service of Pakistan shall be discriminated against in respect of any such appointment on the ground of race, religion, caste, sex, residence or place of birth."}

{"id": "article_28", "text": "Any section of citizens having a distinct language, script or culture shall have the right to preserve and promote the same and, subject to law, establish institutions for that purpose."}

{"id": "article_29", "text": "The principles set out in this Chapter are intended to be observed in the making of laws, and are to be regarded as fundamental guidelines for governance."}

{"id": "article_30", "text": "The responsibility for observing the Principles of Policy shall rest with each organ and authority of the State."}

{"id": "article_31", "text": "Steps shall be taken to enable the Muslims of Pakistan to order their lives in accordance with the fundamental principles and basic concepts of Islam."}

{"id": "article_32", "text": "The State shall encourage local Government institutions composed of elected representatives of the areas concerned."}

{"id": "article_33", "text": "The State shall discourage parochial, racial, tribal, sectarian and provincial prejudices among the citizens."}

{"id": "article_34", "text": "Steps shall be taken to ensure full participation of women in all spheres of national life."}

{"id": "article_35", "text": "The State shall protect the marriage, the family, the mother and the child."}

{"id": "article_36", "text": "The State shall safeguard the legitimate rights and interests of minorities, including their due representation in the Federal and Provincial services."}

{"id": "article_37", "text": "The State shall promote, with special care, the educational and economic interests of backward classes or areas."}

{"id": "article_38", "text": "The State shall secure the well-being of the people by raising their standard of living, by preventing the concentration of wealth and means of production in the hands of a few..."}

{"id": "article_39", "text": "The State shall ensure the participation of people in the Armed Forces of Pakistan."}

{"id": "article_40", "text": "The State shall endeavour to preserve and strengthen fraternal relations among Muslim countries, promote international peace and security, foster goodwill and friendly relations among all nations."}

{"id": "article_41", "text": "There shall be a President of Pakistan who shall be the Head of State and shall represent the unity of the Republic."}

{"id": "article_42", "text": "Before entering upon office, the President shall make before the Chief Justice of Pakistan oath in the form set out in the Third Schedule."}

{"id": "article_43", "text": "The President shall not hold any office of profit in the service of Pakistan or occupy any other position carrying the right to remuneration for the rendering of services."}

{"id": "article_44", "text": "The President shall hold office for a term of five years from the day he enters upon his office."}

{"id": "article_45", "text": "The President shall have power to grant pardon, reprieve and respite, and to remit, suspend or commute any sentence passed by any court."}

{"id": "article_46", "text": "The Prime Minister shall keep the President informed on all matters of internal and foreign policy and on all legislative proposals the Federal Government intends to bring before the Majlis-e-Shoora (Parliament)."}

{"id": "article_47", "text": "The President may be removed from office on the grounds of physical or mental incapacity or misconduct through impeachment by the Parliament."}

{"id": "article_48", "text": "In the exercise of his functions, the President shall act on and in accordance with the advice of the Cabinet or the Prime Minister."}

{"id": "article_49", "text": "When the office of President is vacant, or the President is unable to perform his functions, the Chairman of the Senate shall act as President."}

{"id": "article_50", "text": "The Majlis-e-Shoora (Parliament) shall consist of the President and two Houses to be known respectively as the National Assembly and the Senate."}

{"id": "article_51", "text": "The National Assembly shall consist of not more than 336 seats including reserved seats for women and non-Muslims."}

{"id": "article_52", "text": "The National Assembly shall, unless sooner dissolved, continue for a term of five years from the day of its first meeting."}

{"id": "article_53", "text": "After the general elections, the National Assembly shall elect a Speaker and a Deputy Speaker from among its members."}

{"id": "article_54", "text": "The President may summon either House or both Houses of Parliament and may prorogue them."}

{"id": "article_55", "text": "All decisions in a House shall be taken by majority of the members present and voting, other than as otherwise provided in the Constitution."}

{"id": "article_56", "text": "The President may address either House of Parliament and may send messages to either House."}

{"id": "article_57", "text": "The Prime Minister, a Federal Minister, or a Minister of State may, with the permission of the Speaker, address or participate in proceedings of either House."}

{"id": "article_58", "text": "The President shall dissolve the National Assembly if so advised by the Prime Minister, or on his own discretion if a vote of no-confidence has passed."}

{"id": "article_59", "text": "The Senate shall consist of members elected in accordance with the provisions of the Constitution."}

{"id": "article_60", "text": "The Senate shall elect a Chairman and Deputy Chairman from among its members."}

{"id": "article_61", "text": "The Senate shall not be subject to dissolution but the term of each member shall be six years."}

{"id": "article_62", "text": "A person shall not be qualified to be elected or chosen as a member of Parliament unless he is of good character and is not commonly known as one who violates Islamic injunctions."}

{"id": "article_63", "text": "A person shall be disqualified from being elected or chosen as, and from being, a member of Parliament if he is of unsound mind, is an undischarged insolvent, or has been convicted of a crime involving moral turpitude."}

{"id": "article_64", "text": "A member of either House may, by writing under his hand addressed to the Speaker or the Chairman, resign his seat."}

{"id": "article_65", "text": "A person shall not simultaneously be a member of both Houses, and shall have to resign one if elected to both."}

{"id": "article_66", "text": "There shall be freedom of speech in Parliament, and no member shall be liable to any proceedings in any court in respect of anything said or any vote given."}

{"id": "article_67", "text": "Each House shall make rules for regulating its procedure and the conduct of its business, subject to the Constitution."}

{"id": "article_68", "text": "No discussion shall take place in either House with respect to the conduct of any judge of the Supreme Court or of a High Court in the discharge of his duties."}

{"id": "article_69", "text": "No proceedings in Parliament shall be questioned in any court on the ground of any irregularity of procedure."}

{"id": "article_70", "text": "A Bill with respect to any matter in the Federal Legislative List may originate in either House, and if passed by both Houses shall be presented to the President for assent."}

{"id": "article_71", "text": "If a Bill passed by one House is not passed by the other, it shall be referred to a Mediation Committee for resolution."}

{"id": "article_72", "text": "The President shall assent to a Bill within ten days, or return it for reconsideration. If returned and passed again, the President must assent within ten days."}

{"id": "article_73", "text": "Money Bills shall originate only in the National Assembly. The Senate may make recommendations, but the Assembly may accept or reject them."}

{"id": "article_74", "text": "The President shall, in respect of a Money Bill, act in accordance with the advice of the Cabinet."}

{"id": "article_75", "text": "When a Bill is presented to the President, he shall assent to it, or return it with a request for reconsideration. If passed again, the President must assent."}

{"id": "article_76", "text": "The President shall have the right to address and send messages to the Parliament."}

{"id": "article_77", "text": "No tax shall be levied for the purposes of the Federation except by or under the authority of an Act of Parliament."}

{"id": "article_78", "text": "All revenues received by the Federal Government shall form part of the Federal Consolidated Fund or the Public Account of the Federation."}

{"id": "article_79", "text": "The custody of the Federal Consolidated Fund and the payment of moneys shall be regulated by Act of Majlis-e-Shoora (Parliament)."}

{"id": "article_80", "text": "The Federal Government shall, in respect of every financial year, cause to be laid before the National Assembly a statement of the estimated receipts and expenditure of the Federal Government."}

{"id": "article_81", "text": "The expenditures charged upon the Federal Consolidated Fund shall include the emoluments and allowances of the President, debt repayments, and judicial salaries."}

{"id": "article_82", "text": "So much of the Annual Budget Statement as relates to expenditures charged upon the Federal Consolidated Fund may be discussed but shall not be submitted to the vote of the Assembly."}

{"id": "article_83", "text": "The Assembly shall have power to assent to or refuse expenditure in the Annual Budget other than charged expenditure."}

{"id": "article_84", "text": "If in respect of any financial year it is found necessary to make expenditures not included in the budget, a Supplementary Budget shall be presented before the Assembly."}

{"id": "article_85", "text": "The Federal Government may authorize advance expenditure from the Federal Consolidated Fund in anticipation of the approval of a Supplementary Budget."}

{"id": "article_86", "text": "If the Assembly is not in session and the President is satisfied that circumstances exist which render it necessary to expend money, he may authorize expenditure from the Federal Consolidated Fund."}

{"id": "article_87", "text": "The President shall appoint the Auditor-General of Pakistan, who shall audit accounts of the Federation and Provinces."}

{"id": "article_88", "text": "The Auditor-General shall perform such duties and exercise such powers in relation to the accounts of the Federation and of the Provinces as may be prescribed by law."}

{"id": "article_69", "text": "No proceedings in Parliament shall be questioned in any court on the ground of any irregularity of procedure."}

{"id": "article_70", "text": "A Bill with respect to any matter in the Federal Legislative List may originate in either House, and if passed by both Houses shall be presented to the President for assent."}

{"id": "article_71", "text": "If a Bill passed by one House is not passed by the other, it shall be referred to a Mediation Committee for resolution."}

{"id": "article_72", "text": "The President shall assent to a Bill within ten days, or return it for reconsideration. If returned and passed again, the President must assent within ten days."}

{"id": "article_73", "text": "Money Bills shall originate only in the National Assembly. The Senate may make recommendations, but the Assembly may accept or reject them."}

{"id": "article_74", "text": "The President shall, in respect of a Money Bill, act in accordance with the advice of the Cabinet."}

{"id": "article_75", "text": "When a Bill is presented to the President, he shall assent to it, or return it with a request for reconsideration. If passed again, the President must assent."}

{"id": "article_76", "text": "The President shall have the right to address and send messages to the Parliament."}

{"id": "article_77", "text": "No tax shall be levied for the purposes of the Federation except by or under the authority of an Act of Parliament."}

{"id": "article_78", "text": "All revenues received by the Federal Government shall form part of the Federal Consolidated Fund or the Public Account of the Federation."}

{"id": "article_79", "text": "The custody of the Federal Consolidated Fund and the payment of moneys shall be regulated by Act of Majlis-e-Shoora (Parliament)."}

{"id": "article_80", "text": "The Federal Government shall, in respect of every financial year, cause to be laid before the National Assembly a statement of the estimated receipts and expenditure of the Federal Government."}

{"id": "article_81", "text": "The expenditures charged upon the Federal Consolidated Fund shall include the emoluments and allowances of the President, debt repayments, and judicial salaries."}

{"id": "article_82", "text": "So much of the Annual Budget Statement as relates to expenditures charged upon the Federal Consolidated Fund may be discussed but shall not be submitted to the vote of the Assembly."}

{"id": "article_83", "text": "The Assembly shall have power to assent to or refuse expenditure in the Annual Budget other than charged expenditure."}

{"id": "article_84", "text": "If in respect of any financial year it is found necessary to make expenditures not included in the budget, a Supplementary Budget shall be presented before the Assembly."}

{"id": "article_85", "text": "The Federal Government may authorize advance expenditure from the Federal Consolidated Fund in anticipation of the approval of a Supplementary Budget."}

{"id": "article_86", "text": "If the Assembly is not in session and the President is satisfied that circumstances exist which render it necessary to expend money, he may authorize expenditure from the Federal Consolidated Fund."}

{"id": "article_87", "text": "The President shall appoint the Auditor-General of Pakistan, who shall audit accounts of the Federation and Provinces."}

{"id": "article_88", "text": "The Auditor-General shall perform such duties and exercise such powers in relation to the accounts of the Federation and of the Provinces as may be prescribed by law."}

{"id": "article_97", "text": "Subject to the Constitution, the executive authority of the Federation shall extend to the matters with respect to which Parliament has power to make laws, including the exercise of rights, authority and jurisdiction in and outside Pakistan."}

{"id": "article_98", "text": "The President may, on the advice of the Prime Minister, make rules for the allocation and transaction of the business of the Federal Government."}

{"id": "article_99", "text": "All executive actions of the Federal Government shall be expressed to be taken in the name of the President. Orders and instruments made and executed in the name of the President shall be authenticated in the form specified in rules made by the Federal Government."}

{"id": "article_100", "text": "The President shall appoint an Attorney-General for Pakistan who must be qualified to be appointed as a Judge of the Supreme Court. He shall hold office during the pleasure of the President."}

{"id": "article_101", "text": "There shall be a Governor for each Province who shall be appointed by the President on the advice of the Prime Minister and shall hold office during the pleasure of the President."}

{"id": "article_102", "text": "If the Governor is unable to perform his functions due to absence or any other cause, the Speaker of the Provincial Assembly or any other person directed by the President shall act as Governor."}

{"id": "article_103", "text": "The Governor shall not hold any office of profit in the service of Pakistan or occupy any position carrying the right to remuneration for the rendering of services."}

{"id": "article_104", "text": "When the Governor is absent or unable to perform the functions of his office, the Speaker of the Provincial Assembly shall act as Governor."}

{"id": "article_105", "text": "In the performance of his functions, the Governor shall act in accordance with the advice of the Cabinet or the Chief Minister. The Governor may require the Cabinet to reconsider such advice."}

{"id": "article_106", "text": "Each Province shall have a Provincial Assembly consisting of general seats and seats reserved for women and non-Muslims. The Assembly shall be elected by direct vote."}

{"id": "article_107", "text": "The duration of a Provincial Assembly shall be five years from the day of its first meeting unless sooner dissolved."}

{"id": "article_108", "text": "The Governor shall summon the Provincial Assembly to meet and may prorogue it."}

{"id": "article_109", "text": "The Governor may summon the Provincial Assembly and, unless otherwise provided, shall fix the time and place for its meetings."}

{"id": "article_110", "text": "The Speaker shall preside over the sessions of the Provincial Assembly. In his absence, the Deputy Speaker or another member as provided in the rules shall preside."}

{"id": "article_111", "text": "The quorum to constitute a sitting of the Assembly shall be one-fourth of the total membership."}

{"id": "article_112", "text": "The Governor may dissolve the Provincial Assembly if so advised by the Chief Minister or if a vote of no-confidence is passed and no other member commands the confidence of the majority."}

{"id": "article_113", "text": "A person shall be qualified to be elected to a Provincial Assembly if he is qualified to be elected to the National Assembly."}

{"id": "article_114", "text": "A person shall be disqualified from being a member of the Provincial Assembly for the same reasons as for the National Assembly."}

{"id": "article_115", "text": "The Governor shall lay before the Provincial Assembly the annual budget statement for the Province in respect of every financial year."}

{"id": "article_116", "text": "When a Bill has been passed by the Provincial Assembly, it shall be presented to the Governor for assent. The Governor may assent, return for reconsideration, or reserve it for the President."}

{"id": "article_106", "text": "Each Province shall have a Provincial Assembly consisting of general seats and seats reserved for women and non-Muslims. The Assembly shall be elected by direct vote."}

{"id": "article_107", "text": "The duration of a Provincial Assembly shall be five years from the day of its first meeting unless sooner dissolved."}

{"id": "article_108", "text": "The Governor shall summon the Provincial Assembly to meet and may prorogue it."}

{"id": "article_109", "text": "The Governor may summon the Provincial Assembly and, unless otherwise provided, shall fix the time and place for its meetings."}

{"id": "article_110", "text": "The Speaker shall preside over the sessions of the Provincial Assembly. In his absence, the Deputy Speaker or another member as provided in the rules shall preside."}

{"id": "article_111", "text": "The quorum to constitute a sitting of the Assembly shall be one-fourth of the total membership."}

{"id": "article_112", "text": "The Governor may dissolve the Provincial Assembly if so advised by the Chief Minister or if a vote of no-confidence is passed and no other member commands the confidence of the majority."}

{"id": "article_113", "text": "A person shall be qualified to be elected to a Provincial Assembly if he is qualified to be elected to the National Assembly."}

{"id": "article_114", "text": "A person shall be disqualified from being a member of the Provincial Assembly for the same reasons as for the National Assembly."}

{"id": "article_115", "text": "The Governor shall lay before the Provincial Assembly the annual budget statement for the Province in respect of every financial year."}

{"id": "article_116", "text": "When a Bill has been passed by the Provincial Assembly, it shall be presented to the Governor for assent. The Governor may assent, return for reconsideration, or reserve it for the President."}

{"id": "article_117", "text": "A Bill pending in the Provincial Assembly shall not lapse by reason of the prorogation of the Assembly or the dissolution of the Assembly."}

{"id": "article_118", "text": "All revenues received by the Provincial Government, all loans raised, and all moneys received in repayment of any loan shall form part of a consolidated fund to be known as the Provincial Consolidated Fund."}

{"id": "article_119", "text": "All other moneys received by or on behalf of the Provincial Government shall be credited to the Public Account of the Province."}

{"id": "article_120", "text": "Expenditure from the Provincial Consolidated Fund shall not be made except under the authority of law and shall be in the manner prescribed."}

{"id": "article_121", "text": "The annual budget statement shall show separately the sums required to meet expenditure described by the Constitution as charged upon the Provincial Consolidated Fund and other expenditures proposed to be made."}

{"id": "article_122", "text": "So much of the annual budget statement as relates to expenditure charged upon the Provincial Consolidated Fund may be discussed in, but shall not be submitted to the vote of, the Provincial Assembly."}

{"id": "article_123", "text": "The Provincial Assembly shall have power to make grants in advance for a part of any financial year pending the completion of the procedure prescribed for the voting of the budget."}

{"id": "article_124", "text": "The Provincial Government may authorize expenditure in respect of a new service not included in the annual budget statement, pending its authorization by the Provincial Assembly."}

{"id": "article_125", "text": "If the Provincial Assembly fails to pass the budget before the beginning of the financial year, the Governor may authorize expenditure until the budget is passed."}

{"id": "article_126", "text": "In respect of every financial year, the Provincial Government shall have the accounts of the Province audited and a report laid before the Provincial Assembly."}

{"id": "article_127", "text": "Until the Provincial Assembly makes provision by law in respect of matters provided in this Part, the laws and rules applicable before the Constitution shall continue."}

{"id": "article_128", "text": "The Governor may, except for money bills, promulgate ordinances when the Provincial Assembly is not in session. These ordinances must be laid before the Assembly and shall cease to have effect after ninety days unless extended or replaced by an Act."}

{"id": "article_129", "text": "The executive authority of the Province shall be exercised by the Governor, either directly or through officers subordinate to him."}

{"id": "article_130", "text": "There shall be a Chief Minister of each Province elected by the Provincial Assembly. The Governor shall appoint him and other Ministers on the advice of the Chief Minister."}

{"id": "article_131", "text": "The Chief Minister shall keep the Governor informed on all matters of Provincial administration and legislative proposals."}

{"id": "article_132", "text": "The Cabinet, with the Chief Minister as its head, shall aid and advise the Governor in the exercise of his functions."}

{"id": "article_133", "text": "The Chief Minister shall communicate all decisions of the Cabinet to the Governor and furnish information when required."}

{"id": "article_134", "text": "A Minister shall hold office during the pleasure of the Governor but may resign in writing addressed to the Governor."}

{"id": "article_135", "text": "The Governor shall appoint Provincial Ministers from amongst members of the Provincial Assembly, on the advice of the Chief Minister."}

{"id": "article_136", "text": "A vote of no-confidence against the Chief Minister may be passed by the majority of the total membership of the Provincial Assembly."}

{"id": "article_137", "text": "The Provincial Government may make laws and exercise executive authority for the Province."}

{"id": "article_138", "text": "The Provincial Assembly may impose taxes and make laws to regulate Provincial finance."}

{"id": "article_139", "text": "The rules for the conduct of Provincial Government business shall be made by the Governor."}

{"id": "article_140", "text": "There shall be a local government system established by law in each Province."}

{"id": "article_141", "text": "Parliament may make laws for the whole or any part of Pakistan with respect to any matter in the Federal Legislative List."}

{"id": "article_142", "text": "The Majlis-e-Shoora (Parliament) and a Provincial Assembly shall have power to make laws as provided in the Constitution."}

{"id": "article_143", "text": "If any Provincial law is inconsistent with a Federal law, the Federal law shall prevail."}

{"id": "article_144", "text": "If two or more Provinces desire, Parliament may legislate for matters not in the Federal List for those Provinces."}

{"id": "article_145", "text": "The President may direct a Governor to act as his agent for any matter concerning the Federation in the Province."}

{"id": "article_146", "text": "Parliament may, with the consent of a Provincial Government, delegate administrative functions to it."}

{"id": "article_147", "text": "A Province may entrust functions to the Federal Government with the consent of the Federal Government."}

{"id": "article_148", "text": "Each Province shall exercise its executive authority so as not to impede the executive authority of the Federation."}

{"id": "article_149", "text": "The Federal Government may give directions to a Province to ensure compliance with Federal laws."}

{"id": "article_150", "text": "All executive and legislative authorities shall extend to matters of inter-Provincial coordination."}

{"id": "article_151", "text": "Trade, commerce, and intercourse throughout Pakistan shall be free, subject to certain restrictions."}

{"id": "article_152", "text": "The Federation may acquire land in any Province for Federal purposes."}

{"id": "article_153", "text": "There shall be a Council of Common Interests to resolve Federal-Provincial disputes."}

{"id": "article_154", "text": "The Council of Common Interests shall be responsible to Parliament and must meet at least once in ninety days."}

{"id": "article_155", "text": "Disputes related to water supply from natural sources shall be resolved by the Council of Common Interests."}

{"id": "article_156", "text": "There shall be a National Economic Council to review the country’s economic condition and formulate policy."}

{"id": "article_157", "text": "The Federal Government shall not interfere in Provincial electricity projects without Provincial consent."}

{"id": "article_158", "text": "A Province shall have priority over other parts of Pakistan in using its natural gas."}

{"id": "article_159", "text": "Broadcasting and similar media services shall be regulated by Federal law, but Provinces may establish their own services."}

{"id": "article_160", "text": "The National Finance Commission shall determine the distribution of revenues between the Federation and the Provinces."}

{"id": "article_161", "text": "Natural gas and hydroelectric profits shall be allocated as provided in the Constitution."}

{"id": "article_162", "text": "No tax shall be imposed on the income of Provincial Governments by the Federation."}

{"id": "article_163", "text": "A Provincial Assembly may impose taxes on professions, trades, callings, and employments."}

{"id": "article_164", "text": "A Provincial Government may make grants-in-aid for any public purpose."}

{"id": "article_165", "text": "No tax shall be imposed on property of the Federation or a Province unless authorized by law."}

{"id": "article_166", "text": "The Federation may raise loans upon the security of the Federal Consolidated Fund."}

{"id": "article_167", "text": "Provinces may raise loans, subject to limits fixed by the National Economic Council."}

{"id": "article_168", "text": "The Auditor-General of Pakistan shall be appointed by the President and shall audit the accounts of the Federation and Provinces."}

{"id": "article_169", "text": "The Auditor-General shall audit accounts of any authority or body as prescribed by law."}

{"id": "article_170", "text": "The Auditor-General shall have access to all records for the audit of accounts."}

{"id": "article_171", "text": "Audit reports shall be submitted to the President or the Governor and laid before the relevant legislature."}

{"id": "article_172", "text": "All lands, minerals, and other valuable things not owned by any person belong to the Federal Government."}

{"id": "article_173", "text": "The Federation or a Province may sue or be sued by its name."}

{"id": "article_174", "text": "The Federation and the Provinces may acquire, hold and dispose of property, and may contract."}

{"id": "article_175", "text": "The judiciary shall be separated progressively from the executive within fourteen years from the commencing day."}

{"id": "article_176", "text": "The Supreme Court shall consist of a Chief Justice and such number of other Judges as determined by law."}

{"id": "article_177", "text": "The Chief Justice and Judges of the Supreme Court shall be appointed by the President."}

{"id": "article_178", "text": "Before entering upon office, a Judge of the Supreme Court shall make an oath before the President."}

{"id": "article_179", "text": "A Judge of the Supreme Court shall retire on attaining the age of sixty-five years."}

{"id": "article_180", "text": "An Acting Chief Justice may be appointed when the Chief Justice is absent or unable to perform his duties."}

{"id": "article_181", "text": "A person appointed as an acting Judge of the Supreme Court shall have the powers of a Judge."}

{"id": "article_182", "text": "The President may appoint an ad hoc Judge to the Supreme Court when necessary."}

{"id": "article_183", "text": "The Supreme Court shall sit in Islamabad and at such other places as the Chief Justice may determine."}

{"id": "article_184", "text": "The Supreme Court shall have original jurisdiction in disputes between Governments and may enforce Fundamental Rights."}

{"id": "article_185", "text": "The Supreme Court shall have appellate jurisdiction in civil and criminal matters."}

{"id": "article_186", "text": "The President may refer any question of law to the Supreme Court for its opinion."}

{"id": "article_186A", "text": "The Supreme Court may transfer any case from one High Court to another in the interest of justice."}

{"id": "article_187", "text": "The Supreme Court shall have the power to issue such orders as are necessary for doing complete justice."}

{"id": "article_188", "text": "The Supreme Court shall have the power to review any of its judgments."}

{"id": "article_189", "text": "Any decision of the Supreme Court shall be binding on all other courts."}

{"id": "article_190", "text": "All executive and judicial authorities shall act in aid of the Supreme Court."}

{"id": "article_191", "text": "The Supreme Court may make rules regulating the practice and procedure of the Court."}

{"id": "article_192", "text": "There shall be a High Court for each Province and such other High Courts as established by law."}

{"id": "article_193", "text": "The Chief Justice and Judges of a High Court shall be appointed by the President."}

{"id": "article_194", "text": "A Judge of a High Court shall make an oath before the Governor of the Province."}

{"id": "article_195", "text": "A Judge of a High Court shall hold office until the age of sixty-two years."}

{"id": "article_196", "text": "An Acting Chief Justice may be appointed for a High Court."}

{"id": "article_197", "text": "Additional Judges may be appointed to High Courts for a term not exceeding one year."}

{"id": "article_198", "text": "A High Court shall sit at its principal seat and such other places as determined by law."}

{"id": "article_199", "text": "A High Court may issue orders for the enforcement of Fundamental Rights or for any other legal purpose."}

{"id": "article_200", "text": "No Judge shall be transferred without his consent except by the President after consultation."}

{"id": "article_201", "text": "Decisions of a High Court shall be binding on all subordinate courts within its jurisdiction."}

{"id": "article_202", "text": "A High Court may make rules regulating the practice and procedure of the Court and subordinate courts."}

{"id": "article_203", "text": "Each High Court shall supervise and control all courts subordinate to it."}

{"id": "article_203A", "text": "Provisions related to the Federal Shariat Court."}

{"id": "article_204", "text": "Every court shall have the power to punish for contempt of itself."}

{"id": "article_205", "text": "Remuneration and terms and conditions of Judges shall be as determined by law."}

{"id": "article_206", "text": "If a Judge does not accept transfer, he shall be deemed to have retired."}

{"id": "article_207", "text": "A person who has held judicial office shall not plead or act before any court or authority in Pakistan."}

{"id": "article_208", "text": "The Supreme Court and High Courts may appoint staff and prescribe their service conditions."}

{"id": "article_209", "text": "The Supreme Judicial Council shall inquire into the conduct of Judges."}

{"id": "article_210", "text": "The Council may frame rules for its procedure."}

{"id": "article_211", "text": "No proceedings before the Supreme Judicial Council shall be called into question in any court."}

{"id": "article_212", "text": "Administrative Courts and Tribunals may be established by law to exercise exclusive jurisdiction in certain matters."}

{"id": "article_213", "text": "The Chief Election Commissioner shall be appointed by the President."}

{"id": "article_214", "text": "The Chief Election Commissioner shall take oath before the Chief Justice of Pakistan."}

{"id": "article_215", "text": "The term of office of the Chief Election Commissioner shall be five years."}

{"id": "article_216", "text": "The Chief Election Commissioner shall not hold any other office of profit."}

{"id": "article_217", "text": "An acting Chief Election Commissioner may be appointed in certain circumstances."}

{"id": "article_218", "text": "The Election Commission shall consist of the Chief Election Commissioner and members appointed by the President."}

{"id": "article_219", "text": "The duties of the Election Commission shall include preparation of electoral rolls and conducting elections."}

{"id": "article_220", "text": "All executive authorities are obligated to assist the Election Commission in the performance of its duties."}

{"id": "article_221", "text": "The Election Commission is empowered to appoint its officers and supporting staff as necessary."}

{"id": "article_222", "text": "Parliament has the authority to enact laws concerning all matters relating to the conduct of elections."}

{"id": "article_223", "text": "No individual is permitted to simultaneously serve as a member of both Houses or of a House and a Provincial Assembly."}

{"id": "article_224", "text": "General elections must be held within sixty days following the expiration of the term of an Assembly."}

{"id": "article_225", "text": "The validity of any election may only be challenged through an election petition filed in accordance with the law."}

{"id": "article_226", "text": "All elections conducted under the Constitution are required to be held through a secret ballot."}

{"id": "article_227", "text": "All existing laws must be brought into conformity with the injunctions of Islam as laid out in the Holy Quran and Sunnah."}

{"id": "article_228", "text": "The President is required to establish the Council of Islamic Ideology to guide Islamic legislation."}

{"id": "article_229", "text": "The President may refer any legal or religious matter to the Council of Islamic Ideology for its advisory opinion."}

{"id": "article_230", "text": "The Council of Islamic Ideology may submit its reports and recommendations to the Parliament and Provincial Assemblies for consideration."}

{"id": "article_231", "text": "The first general elections under the Constitution are to be conducted in accordance with the applicable laws at the time."}

{"id": "article_232", "text": "The President may declare a state of emergency if war, internal disturbances, or threats to the security of Pakistan arise."}

{"id": "article_233", "text": "During a state of emergency, certain fundamental rights guaranteed by the Constitution may be temporarily suspended."}

{"id": "article_234", "text": "If constitutional machinery in a Province fails, the President may assume the executive functions of that Province."}

{"id": "article_235", "text": "The President may declare a financial emergency if the financial stability or credit of Pakistan or any of its Provinces is threatened."}

{"id": "article_236", "text": "Amendments to the Constitution may be made by an Act of Parliament passed in accordance with constitutional procedures."}

{"id": "article_237", "text": "Parliament may pass a law to indemnify individuals for acts committed in connection with the restoration of law and order."}

{"id": "article_238", "text": "The Constitution may only be amended through the procedure laid out in Part XI of the Constitution."}

{"id": "article_239", "text": "A Constitutional Amendment Bill must be passed by a two-thirds majority vote in both the National Assembly and the Senate."}

{"id": "article_240", "text": "Appointments and conditions of service in the public sector shall be governed by law, subject to the provisions of the Constitution."}

{"id": "article_241", "text": "Until specific laws are enacted, existing administrative procedures and conditions shall remain in effect."}

{"id": "article_242", "text": "Public Service Commissions shall be established by the President for the Federation and by the Governors for the Provinces."}
{"id": "article_243", "text": "The President holds supreme command over the Armed Forces of Pakistan."}

{"id": "article_244", "text": "Every member of the Armed Forces is required to take an oath in the form prescribed by the Constitution."}

{"id": "article_245", "text": "The Armed Forces shall provide assistance to civilian authorities when called upon by the Federal Government."}

{"id": "article_246", "text": "This article defines the Tribal Areas of Pakistan and categorizes them into Provincially and Federally Administered Tribal Areas."}

{"id": "article_247", "text": "This article, relating to the administration of Tribal Areas, has been repealed by the Twenty-Fifth Amendment."}

{"id": "article_248", "text": "The President, Prime Minister, Governors, and certain other officeholders are not answerable to courts for actions done in their official capacity."}

{"id": "article_249", "text": "Legal proceedings may continue against a Province that assumes responsibilities previously held by the Federation."}

{"id": "article_250", "text": "All taxes must be imposed by a law duly enacted by the appropriate legislative body."}

{"id": "article_251", "text": "Urdu shall be the national language of Pakistan and steps shall be taken to promote and use it."}

{"id": "article_252", "text": "Special legal provisions may be made for the implementation of international treaties and agreements."}

{"id": "article_253", "text": "Parliament may legislate to regulate trade, commerce, and industry in the interest of national security or economic stability."}

{"id": "article_254", "text": "Failure to meet prescribed time limits does not render an act or proceeding under the Constitution invalid."}

{"id": "article_255", "text": "Oaths taken under the Constitution remain valid even if some procedural formalities are not fulfilled."}

{"id": "article_256", "text": "Private military organizations are strictly prohibited in Pakistan."}

{"id": "article_257", "text": "The accession of Jammu and Kashmir to Pakistan shall be decided by the people of that region."}

{"id": "article_258", "text": "The Federal Government may delegate its functions to subordinate authorities where appropriate."}

{"id": "article_259", "text": "The President has the authority to confer civil awards and honors for services rendered to the nation."}

{"id": "article_260", "text": "This article provides definitions for key terms used throughout the Constitution."}

{"id": "article_261", "text": "This article includes provisions related to the functioning and jurisdiction of the Supreme Court and High Courts."}

{"id": "article_262", "text": "The Islamic (Hijri) calendar shall be used for specific religious and official purposes as required by law."}

{"id": "article_263", "text": "No person shall hold dual membership in any legislative body of Pakistan."}

{"id": "article_264", "text": "The repeal of any law does not affect existing rights, liabilities, or legal proceedings instituted under that law."}

{"id": "article_265", "text": "Taxes cannot be levied for the benefit of the Federation or any Province unless authorized by law."}

{"id": "article_266", "text": "This article outlines special financial and audit-related provisions necessary for governmental functioning."}

{"id": "article_267", "text": "The President is empowered to make provisions to remove difficulties in implementing the Constitution."}

{"id": "article_268", "text": "Laws specified in the Sixth Schedule may not be altered without the prior approval of the President."}

{"id": "article_269", "text": "Laws and actions taken during specific periods are validated and given legal effect."}

{"id": "article_270", "text": "Laws existing at the time of the Constitution’s commencement shall continue in force unless altered or repealed."}

{"id": "article_270A", "text": "This article validates certain laws and actions taken between specified periods by competent authorities."}

{"id": "article_270AA", "text": "Laws continued and validated following constitutional amendments shall remain effective."}

{"id": "article_271", "text": "This article provides for transitional provisions to ensure continuity during constitutional implementation."}

{"id": "article_272", "text": "Existing constitutional institutions and their members shall continue to function until replaced under the new Constitution."}

{"id": "article_273", "text": "The President has the authority to resolve transitional issues or difficulties during constitutional implementation."}

{"id": "article_274", "text": "Government officers shall remain in office until new appointments are made."}

{"id": "article_275", "text": "Laws enacted by the Parliament shall extend to the entire territory of Pakistan unless stated otherwise."}

{"id": "article_276", "text": "The repeal of previous constitutions shall not affect the continuation of existing legal frameworks."}

{"id": "article_277", "text": "Taxes in force immediately before the commencement of this Constitution shall continue until changed by law."}

{"id": "article_278", "text": "Existing laws shall remain in force unless inconsistent with this Constitution or repealed by it."}

{"id": "article_279", "text": "The appropriate authorities are empowered to make rules and regulations to carry out the purposes of this Constitution."}

{"id": "article_280", "text": "This Constitution shall be cited as the Constitution of the Islamic Republic of Pakistan."}
